# å®ä¹ äºŒ æ•°æ®åº“çº¦æŸè®¾è®¡
æˆå‘˜ï¼šæ¢æ˜±æ¡ å´å¢¨ç¬› è¢æ¢¦

In [47]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [48]:
import pymysql
pymysql.install_as_MySQLdb()

In [49]:
%%sql 

mysql://stu2100013081:stu2100013081@162.105.146.37:43306
show databases;
use stu2100013081;
show tables;

4 rows affected.
0 rows affected.
8 rows affected.

[('SC',),
 ('STC',),
 ('STC_trigger',),
 ('TC',),
 ('code_table',),
 ('dept',),
 ('emp',),
 ('tmptable',)]

In [50]:
import pymysql

conn = pymysql.connect(host='162.105.146.37', port=43306, user='stu2100013081', passwd='stu2100013081', db='stu2100013081')
cursor = conn.cursor()

try:
    # ç¦ç”¨å¤–é”®çº¦æŸ
    cursor.execute("SET FOREIGN_KEY_CHECKS=0;")

    # è·å–æ‰€æœ‰è¡¨çš„åç§°
    cursor.execute("SHOW TABLES")
    tables = cursor.fetchall()

    # éå†æ‰€æœ‰è¡¨ï¼Œå¯¹æ¯ä¸€ä¸ªè¡¨æ‰§è¡Œæ¸…ç©ºæ“ä½œ
    for table_name in tables:
        sql = f"TRUNCATE TABLE {table_name[0]}"
        cursor.execute(sql)

    # é‡æ–°å¯ç”¨å¤–é”®çº¦æŸ
    cursor.execute("SET FOREIGN_KEY_CHECKS=1;")

    conn.commit()
    print("æ‰€æœ‰è¡¨çš„æ•°æ®å·²æ¸…ç©ºã€‚")
except Exception as e:
    print(f"é”™è¯¯ï¼š{e}")
    conn.rollback()
finally:
    cursor.close()
    conn.close()

æ‰€æœ‰è¡¨çš„æ•°æ®å·²æ¸…ç©ºã€‚

## åŸºæœ¬çº¦æŸè®¾è®¡
emp(eno, ename, birtyday, level, position, salary, dno)  
dept( dno, dname, budget, manager )

1. å£°æ˜enoå’Œdnoæ˜¯é€’å¢åºåˆ—å·å½¢å¼çš„ä¸»ç ï¼Œé•¿åº¦ä¸º4çš„æ•´å‹ï¼Œå½¢å¼ä¸º0001,0002ï¼Œâ€¦  
2. å£°æ˜Empä¸­çš„dnoä¸ºå‚ç…§Deptçš„å¤–ç ï¼Œ Deptçš„managerä¸ºå‚ç…§Empçš„å¤–ç  
3. æµ‹è¯•å¤–ç å®šä¹‰çš„ä¸‰ç§å½¢å¼ 
4. é™å®šdnameä¸ºæšä¸¾å‹ï¼ˆæ•°å­¦å­¦é™¢ã€è®¡ç®—æœºå­¦é™¢ã€æ™ºèƒ½å­¦é™¢ã€ç”µå­å­¦é™¢ã€å…ƒåŸ¹å­¦é™¢ï¼‰ 
5. é™å®špositionä¸ºæšä¸¾å‹ï¼ˆæ•™å¸ˆã€æ•™åŠ¡ã€ä¼šè®¡ã€ç§˜ä¹¦ï¼‰  
6. é™å®šlevelä¸º1åˆ°5ï¼Œç¼ºçœä¸º3ï¼Œsalaryä¸º2000~200000

å»ºè¡¨å¹¶æ·»åŠ çº¦æŸï¼š

In [51]:
%%sql
-- åˆ é™¤å·²å­˜åœ¨çš„è¡¨
set foreign_key_checks = 0;
drop table if exists emp;
drop table if exists dept;
set foreign_key_checks = 1;

-- åˆ›å»ºæ–°çš„è¡¨
create table emp (
  eno int(4) zerofill not null auto_increment,
  ename varchar(255),
  birthday date,
  level int check (level >= 1 and level <= 5) default 3,
  position enum('æ•™å¸ˆ', 'æ•™åŠ¡', 'ä¼šè®¡', 'ç§˜ä¹¦'),
  salary decimal(10,2) check (salary >= 2000 and salary <= 200000),
  dno int(4) zerofill,
  primary key (eno)
);

create table dept (
  dno int(4) zerofill not null auto_increment,
  dname enum('æ•°å­¦å­¦é™¢', 'è®¡ç®—æœºå­¦é™¢', 'æ™ºèƒ½å­¦é™¢', 'ç”µå­å­¦é™¢', 'å…ƒåŸ¹å­¦é™¢'),
  budget decimal(10,2),
  manager int(4) zerofill,
  primary key (dno)
);

-- æ·»åŠ å¤–ç çº¦æŸ
alter table emp add foreign key (dno) references dept(dno);
alter table dept add foreign key (manager) references emp(eno);

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

### çº¦æŸæ¡ä»¶æµ‹è¯•-æ­£ä¾‹

å‘deptè¡¨æ’å…¥æ•°æ®ï¼š

In [52]:
%%sql
insert into dept(dname, budget) values('æ•°å­¦å­¦é™¢', 1000000.00);
insert into dept(dname, budget) values('è®¡ç®—æœºå­¦é™¢', 2000000.00);

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
1 rows affected.

[]

ç¡®è®¤æ’å…¥æ•°æ®æ˜¯å¦æ­£ç¡®ï¼š

In [53]:
%sql select * from dept;

 * mysql://stu2100013081:***@162.105.146.37:43306
2 rows affected.

[(1, 'æ•°å­¦å­¦é™¢', Decimal('1000000.00'), None),
 (2, 'è®¡ç®—æœºå­¦é™¢', Decimal('2000000.00'), None)]

å‘empè¡¨æ’å…¥æ•°æ®ï¼š

In [54]:
%%sql
insert into emp(ename, birthday, level, position, salary, dno) values('æè€å¸ˆ', '1970-01-01', 3, 'æ•™å¸ˆ', 5000.00, 0001);
insert into emp(ename, birthday, level, position, salary, dno) values('èµµæ•™åŠ¡', '1980-02-02', 4, 'æ•™åŠ¡', 8000.00, 0002);

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
1 rows affected.

[]

ç¡®è®¤æ’å…¥æ•°æ®æ˜¯å¦æ­£ç¡®ï¼š

In [55]:
%sql select * from emp;

 * mysql://stu2100013081:***@162.105.146.37:43306
2 rows affected.

[(1, 'æè€å¸ˆ', datetime.date(1970, 1, 1), 3, 'æ•™å¸ˆ', Decimal('5000.00'), 1),
 (2, 'èµµæ•™åŠ¡', datetime.date(1980, 2, 2), 4, 'æ•™åŠ¡', Decimal('8000.00'), 2)]

æ›´æ–°deptè¡¨ï¼Œè®¾ç½®ç»ç†ï¼š

In [56]:
%%sql
update dept set manager=0001 where dno=0001;
update dept set manager=0002 where dno=0002;

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
1 rows affected.

[]

ç¡®è®¤æ›´æ–°æ•°æ®æ˜¯å¦æ­£ç¡®ï¼š

In [57]:
%sql select * from dept;

 * mysql://stu2100013081:***@162.105.146.37:43306
2 rows affected.

[(1, 'æ•°å­¦å­¦é™¢', Decimal('1000000.00'), 1), (2, 'è®¡ç®—æœºå­¦é™¢', Decimal('2000000.00'), 2)]

### çº¦æŸæ¡ä»¶æµ‹è¯•-åä¾‹

æµ‹è¯•levelå’Œsalaryçš„checkçº¦æŸï¼šå°è¯•æ’å…¥ä¸åˆæ³•æ•°æ®

In [58]:
%%sql
insert into emp(ename, birthday, level, position, salary, dno) values('æµ‹è¯•', '1990-03-03', 6, 'æ•™åŠ¡', 3000.00, 0001); -- levelè¶…å‡ºèŒƒå›´1-5
insert into emp(ename, birthday, level, position, salary, dno) values('æµ‹è¯•', '1990-03-03', 3, 'æ•™åŠ¡', 300000.00, 0001); -- salaryè¶…å‡ºèŒƒå›´2000-200000

 * mysql://stu2100013081:***@162.105.146.37:43306
(pymysql.err.OperationalError) (3819, "Check constraint 'emp_chk_1' is violated.")
[SQL: insert into emp(ename, birthday, level, position, salary, dno) values('æµ‹è¯•', '1990-03-03', 6, 'æ•™åŠ¡', 3000.00, 0001); -- levelè¶…å‡ºèŒƒå›´1-5]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

æµ‹è¯•å¤–é”®çº¦æŸï¼šå°è¯•æ’å…¥ä¸å­˜åœ¨çš„éƒ¨é—¨ç¼–å·

In [59]:
%sql insert into emp(ename, birthday, level, position, salary, dno) values('æµ‹è¯•', '1990-03-03', 3, 'æ•™åŠ¡', 3000.00, 9999);

 * mysql://stu2100013081:***@162.105.146.37:43306
(pymysql.err.IntegrityError) (1452, 'Cannot add or update a child row: a foreign key constraint fails (`stu2100013081`.`emp`, CONSTRAINT `emp_ibfk_1` FOREIGN KEY (`dno`) REFERENCES `dept` (`dno`))')
[SQL: insert into emp(ename, birthday, level, position, salary, dno) values('æµ‹è¯•', '1990-03-03' , 3, 'æ•™åŠ¡' , 3000.00, 9999);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

æµ‹è¯•å¤–é”®çº¦æŸï¼šå°è¯•åˆ é™¤å­˜åœ¨å‘˜å·¥çš„éƒ¨é—¨

In [60]:
%sql delete from dept where dno=0001;

 * mysql://stu2100013081:***@162.105.146.37:43306
(pymysql.err.IntegrityError) (1451, 'Cannot delete or update a parent row: a foreign key constraint fails (`stu2100013081`.`emp`, CONSTRAINT `emp_ibfk_1` FOREIGN KEY (`dno`) REFERENCES `dept` (`dno`))')
[SQL: delete from dept where dno=0001;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

## ä¸­çº§çº¦æŸè®¾è®¡

è¦æ±‚ï¼š  
1. æµ‹è¯•å»¶è¿Ÿçº¦æŸï¼Œå¾€Empå’ŒDeptä¸­æ’å…¥äº’ç›¸å‚ç…§çš„ä¸¤è¡Œã€‚PGæ˜¯æ”¯æŒå»¶è¿Ÿçº¦æŸçš„ï¼ŒMySQLä¸æ”¯æŒå»¶è¿Ÿçº¦æŸï¼Œå¯ä»¥é€šè¿‡è®¾ç½®çº¦æŸæ˜¯å¦æœ‰æ•ˆæ¥å®Œæˆ
2. å°†salaryåˆ’åˆ†ä¸º5ä¸ªåŒºé—´ï¼Œæ¯ä¸ªåŒºé—´å¯¹åº”ä¸€ä¸ªlevelå€¼ï¼Œä¿è¯æ¯ä¸ªå‘˜å·¥çš„å·¥èµ„å€¼å’Œä»–çš„levelå€¼æ˜¯æ­£ç¡®å¯¹åº”çš„ï¼Œè¿™å±äºè¡Œçº§çº¦æŸ
3. ç¼–å†™å‡½æ•°ï¼Œè¾“å…¥å‘˜å·¥çš„å‘˜å·¥å·ï¼Œè¾“å‡ºä¸€ä¸ªåŒ…å«å‘˜å·¥å„æ–¹é¢ä¿¡æ¯çš„ç¼–ç å­—ç¬¦ä¸²ï¼Œä¹Ÿå³ç¬¬äºŒç« ä¸­æåˆ°çš„æ™ºèƒ½ç ã€‚  

åœ¨å®ç°æ—¶ï¼Œè§„èŒƒçš„åšæ³•æ˜¯æ„é€ ä¸€å¼ ç¼–ç å¯¹ç…§è¡¨ï¼Œè€Œä¸æ˜¯æŠŠç¼–ç å¯¹åº”ä¿¡æ¯ç›´æ¥æ”¾åœ¨ä»£ç é‡Œé¢

### é€šè¿‡è®¾ç½®çº¦æŸæ˜¯å¦æœ‰æ•ˆæµ‹è¯•å»¶è¿Ÿçº¦æŸï¼š

æˆ‘ä»¬é¦–å…ˆå…³é—­å¤–é”®æ£€æŸ¥ï¼Œç„¶åå‘empå’Œdeptè¡¨ä¸­æ’å…¥äº’ç›¸å¼•ç”¨çš„ä¸¤è¡Œæ•°æ®ï¼Œç„¶åå†å¼€å¯å¤–é”®æ£€æŸ¥ã€‚è¿™æ ·ï¼Œæˆ‘ä»¬å°±å¯ä»¥åœ¨ä¸¤ä¸ªè¡¨ä¹‹é—´åˆ›å»ºäº’ç›¸å¼•ç”¨çš„è¡Œï¼Œè€Œä¸ä¼šå› ä¸ºè¿åå¤–é”®çº¦æŸè€Œå¯¼è‡´æ’å…¥å¤±è´¥ã€‚

In [61]:
%%sql
-- å…³é—­å¤–é”®æ£€æŸ¥
set foreign_key_checks = 0;

-- å‘empè¡¨æ’å…¥æ•°æ®
insert into emp(ename, birthday, level, position, salary, dno) VALUES('éƒ­è€å¸ˆ', '1963-12-24', 1, 'æ•™å¸ˆ', 5000.00, 0001);

-- å‘deptè¡¨æ’å…¥æ•°æ®
insert into dept(dname, budget, manager) VALUES('ç‰©ç†å­¦é™¢', 1000000.00, 0001);

-- å¼€å¯å¤–é”®æ£€æŸ¥
set foreign_key_checks = 1;

 * mysql://stu2100013081:***@162.105.146.37:43306

0 rows affected.
1 rows affected.
(pymysql.err.DataError) (1265, "Data truncated for column 'dname' at row 1")
[SQL: -- å‘deptè¡¨æ’å…¥æ•°æ®
insert into dept(dname, budget, manager) VALUES('ç‰©ç†å­¦é™¢', 1000000.00, 0001);]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

æŸ¥è¯¢åˆšæ’å…¥çš„æ•°æ®ï¼š

In [62]:
%sql select * from emp where eno = 0001;

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.

[(1, 'æè€å¸ˆ', datetime.date(1970, 1, 1), 3, 'æ•™å¸ˆ', Decimal('5000.00'), 1)]

In [63]:
%sql select * from dept where dno = 0001;

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.

[(1, 'æ•°å­¦å­¦é™¢', Decimal('1000000.00'), 1)]

### è¡Œçº§çº¦æŸ

åˆ›å»ºè§¦å‘å™¨åœ¨æ’å…¥æˆ–æ›´æ–°æ•°æ®æ—¶æ£€æŸ¥salaryå’Œlevelæ˜¯å¦åŒ¹é…

In [64]:
%%sql
create trigger check_salary_level_before_insert before insert on emp
for each row
begin
	if new.salary < 4000 then
		if new.level <> 1 then
			signal sqlstate '45000' set message_text = 'Salary and level do not match.';
		end if;
	elseif new.salary < 8000 then
		if new.level <> 2 then
			signal sqlstate '45000' set message_text = 'Salary and level do not match.';
		end if;
	elseif new.salary < 12000 then
		if new.level <> 3 then
			signal sqlstate '45000' set message_text = 'Salary and level do not match.';
		end if;
	elseif new.salary < 16000 then
		if new.level <> 4 then
			signal sqlstate '45000' set message_text = 'Salary and level do not match.';
		end if;
	else
		if new.level <> 5 then
			signal sqlstate '45000' set message_text = 'Salary and level do not match.';
		end if;
	end if;
end;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.

[]

æµ‹è¯•ä»£ç ï¼š

æ­£ç¡®çš„æ’å…¥ï¼Œåº”è¯¥æˆåŠŸ

In [65]:
%%sql
insert into emp(ename, birthday, level, position, salary, dno) 
values('é™ˆè€å¸ˆ', '1980-01-01', 3, 'æ•™åŠ¡', 10000.00, 0001);
select * from emp;

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
4 rows affected.

[(1, 'æè€å¸ˆ', datetime.date(1970, 1, 1), 3, 'æ•™å¸ˆ', Decimal('5000.00'), 1),
 (2, 'èµµæ•™åŠ¡', datetime.date(1980, 2, 2), 4, 'æ•™åŠ¡', Decimal('8000.00'), 2),
 (4, 'éƒ­è€å¸ˆ', datetime.date(1963, 12, 24), 1, 'æ•™å¸ˆ', Decimal('5000.00'), 1),
 (5, 'é™ˆè€å¸ˆ', datetime.date(1980, 1, 1), 3, 'æ•™åŠ¡', Decimal('10000.00'), 1)]

é”™è¯¯çš„æ’å…¥ï¼Œåº”è¯¥å¤±è´¥å¹¶è§¦å‘è§¦å‘å™¨ä¸­çš„é”™è¯¯ä¿¡æ¯

In [66]:
%%sql
insert into emp(ename, birthday, level, position, salary, dno) 
values('å­™è€å¸ˆ', '1985-01-01', 2, 'ä¼šè®¡', 10000.00, 0001);
select * from emp;

 * mysql://stu2100013081:***@162.105.146.37:43306
(pymysql.err.OperationalError) (1644, 'Salary and level do not match.')
[SQL: insert into emp(ename, birthday, level, position, salary, dno)
values('å­™è€å¸ˆ', '1985-01-01', 2, 'ä¼šè®¡', 10000.00, 0001);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

### è¾“å‡ºç¼–ç å­—ç¬¦ä¸²

æ„é€ ä¸€å¼ ç¼–ç å¯¹ç…§è¡¨

In [67]:
%%sql
drop table if exists code_table;
create table code_table (
    type enum('level', 'position'),
    name varchar(255),
    code char(2)
);

insert into code_table (type, name, code) VALUES 
    ('level', '1', '01'),
    ('level', '2', '02'),
    ('level', '3', '03'),
    ('level', '4', '04'),
    ('level', '5', '05'),
    ('position', 'æ•™å¸ˆ', '01'),
    ('position', 'æ•™åŠ¡', '02'),
    ('position', 'ä¼šè®¡', '03'),
    ('position', 'ç§˜ä¹¦', '04');

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
9 rows affected.

[]

In [68]:
%%sql
drop function if exists get_emp_info;
create function get_emp_info(eno int) returns char(20)
begin
    declare dno char(4);
    declare birthyear char(4);
    declare level_code char(2);
    declare position_code char(2);
    declare manager char(4);
    
    select 
        LPAD(e.dno, 4, '0'), 
        year(e.birthday), 
        (select code from code_table where type = 'level' and name = CAST(e.level as char)), 
        (select code from code_table where type = 'position' and name = e.position), 
        LPAD(d.manager, 4, '0')
    into 
        dno, birthyear, level_code, position_code, manager
    from
        emp e JOIN dept d ON e.dno = d.dno
    where
        e.eno = eno;
    
    return CONCAT(LPAD(eno, 4, '0'), dno, birthyear, level_code, position_code, manager);
end;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

æµ‹è¯•ä»£ç ï¼š

In [69]:
%sql select get_emp_info(1);

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.

[('00010001197003010001',)]

In [70]:
%sql select get_emp_info(2);

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.

[('00020002198004020002',)]

In [71]:
%sql select get_emp_info(3);

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.

[(None,)]

## é«˜çº§çº¦æŸè®¾è®¡

è¦æ±‚ï¼š  
1. å¦‚æœæ’å…¥çš„æ•°æ®è¿åçº¦æŸå®šä¹‰ï¼Œä½¿ç”¨è§¦å‘å™¨ä¿®æ”¹æ•°æ®ï¼Œä½¿å…¶ç¬¦åˆçº¦æŸåå†æ’å…¥ï¼Œå¯ä»¥ä½¿ç”¨beforeæˆ–è€…instead ofè§¦å‘å™¨å®Œæˆã€‚å¯¹äºä¸­çº§çº¦æŸçš„ç¬¬2é¡¹ä»»åŠ¡ï¼Œå®šä¹‰ç›‘è§†Empè¡¨ä¸Šæ’å…¥å’Œæ›´æ–°æ“ä½œçš„è§¦å‘å™¨ï¼ŒæŒ‰ç…§salaryçš„æ–°å€¼æ¥è®¾ç½®å…¶levelå€¼å³å¯ã€‚
2. ä½¿ç”¨å‡½æ•°çº¦æŸæˆ–è€…è§¦å‘å™¨æ¥ä¿è¯ç®¡ç†è€…çš„å·¥èµ„å¿…é¡»é«˜äºä»–æ‰€ç®¡ç†çš„ä»»ä½•ä¸€ä¸ªå‘˜å·¥
3. ä½¿ç”¨è§¦å‘å™¨ä¿è¯ä»»ä½•ä¸€ä¸ªå‘˜å·¥å·¥èµ„çš„å˜åŒ–é¢åº¦ï¼Œéƒ½åº”è¯¥ä½“ç°åœ¨ä»–æ‰€åœ¨éƒ¨é—¨çš„é¢„ç®—ä¸Šé¢ï¼Œæœ¬è´¨ä¸Šè¿™ç›¸å½“äºå®ç°äº†ä¸€ä¸ªç‰©åŒ–è§†å›¾çš„ä¸€è‡´æ€§ç»´æŠ¤æœºåˆ¶ï¼ˆè§¦å‘å™¨åº”è¯¥è€ƒè™‘åˆ°å‘˜å·¥æ”¹å˜å·¥ä½œéƒ¨é—¨çš„æƒ…å†µï¼Œä»ä¸€è‡´æ€§ç»´æŠ¤æ•ˆç‡çš„è§’åº¦ï¼Œå®Œå…¨é‡ç®—å½“ç„¶æœ€ç®€å•ï¼Œä½†å¸Œæœ›è¿˜æ˜¯å®ç°åŸºäºæ›´æ–°è¡Œçš„å¢é‡æ›´æ–°ï¼‰

### æ ¹æ®salaryçš„æ–°å€¼è®¾ç½®levelå€¼

In [72]:
%%sql
drop trigger if exists check_salary_level_before_insert;
create trigger emp_before_insert before insert on emp
for each row
begin
    case
        when new.salary < 4000 then set new.level = 1;
        when new.salary < 8000 then set new.level = 2;
        when new.salary < 12000 then set new.level = 3;
        when new.salary < 16000 then set new.level = 4;
        else set new.level = 5;
    end case;
end;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

æµ‹è¯•ä»£ç ï¼š

In [73]:
%%sql
insert into emp (ename, birthday, level, position, salary, dno) 
values ('æ¨Šè€å¸ˆ', '2000-09-24', 3, 'æ•™å¸ˆ', 3000, 1); 

select * from emp where ename = 'æ¨Šè€å¸ˆ';

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
1 rows affected.

[(6, 'æ¨Šè€å¸ˆ', datetime.date(2000, 9, 24), 1, 'æ•™å¸ˆ', Decimal('3000.00'), 1)]

### ä¿è¯ç®¡ç†è€…çš„å·¥èµ„å¿…é¡»é«˜äºä»–æ‰€ç®¡ç†çš„ä»»ä½•ä¸€ä¸ªå‘˜å·¥ï¼š

In [74]:
%%sql
create trigger emp_before_update_salary before update on emp
for each row
begin
    if exists (
        select 1 
        from emp e 
        where e.dno = new.dno and e.salary > new.salary
    ) then
        signal sqlstate '45000' set message_text = 'Manager salary must be higher than any employee he/she manages';
    END IF;
end;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.

[]

æµ‹è¯•ä»£ç ï¼š

æ­¤æ›´æ–°åº”è¯¥å¤±è´¥ï¼Œå› ä¸ºç®¡ç†è€…å·¥èµ„åº”è¯¥åœ¨éƒ¨é—¨å†…æœ€é«˜

In [75]:
%sql update emp set salary = 4000 where eno = 2;

 * mysql://stu2100013081:***@162.105.146.37:43306
(pymysql.err.OperationalError) (1644, 'Manager salary must be higher than any employee he/she manages')
[SQL: update emp set salary = 4000 where eno = 2;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

æ­¤æ›´æ–°åº”è¯¥æˆåŠŸ

In [76]:
%%sql 
update emp set salary = 40000 where eno = 2;
select * from emp where eno = 2;

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
1 rows affected.

[(2, 'èµµæ•™åŠ¡', datetime.date(1980, 2, 2), 4, 'æ•™åŠ¡', Decimal('40000.00'), 2)]

### ä¿è¯ä»»ä½•ä¸€ä¸ªå‘˜å·¥å·¥èµ„çš„å˜åŒ–é¢åº¦ï¼Œéƒ½åº”è¯¥ä½“ç°åœ¨ä»–æ‰€åœ¨éƒ¨é—¨çš„é¢„ç®—ä¸Šé¢ï¼š

In [77]:
%%sql
create trigger emp_after_update_salary after update on emp
for each row
begin
    if old.dno = new.dno  then
        update dept set budget = budget + new.salary - old.salary where dno = new.dno;
    else
        update dept set budget = budget - old.salary where dno = old.dno;
        update dept set budget = budget + new.salary where dno = new.dno;
    end if;
end;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.

[]

æµ‹è¯•ä»£ç ï¼š

æ›´æ–°å‰å„éƒ¨é—¨é¢„ç®—ï¼š

In [78]:
%sql select * from dept;

 * mysql://stu2100013081:***@162.105.146.37:43306
2 rows affected.

[(1, 'æ•°å­¦å­¦é™¢', Decimal('1000000.00'), 1), (2, 'è®¡ç®—æœºå­¦é™¢', Decimal('2000000.00'), 2)]

In [79]:
%%sql
update emp set salary = 70000 where eno = 1; 
select * from dept;

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
2 rows affected.

[(1, 'æ•°å­¦å­¦é™¢', Decimal('1065000.00'), 1), (2, 'è®¡ç®—æœºå­¦é™¢', Decimal('2000000.00'), 2)]

### è¿™ä¸ªçº¦æŸè®¾è®¡ç”¨æ¥ç»´æŠ¤å…³ç³»æ¨¡å¼ä¸Šçš„å‡½æ•°ä¾èµ–

å…ˆå‡å®šè¡¨ğ‘†ğ‘‡ğ¶(ğ‘ ğ‘›ğ‘œ,ğ‘¡ğ‘›ğ‘œ,ğ‘ğ‘›ğ‘œ)"ä¸Šæˆç«‹å‡½æ•°ä¾èµ–" ğ‘¡ğ‘›ğ‘œâ†’ğ‘ğ‘›ğ‘œ"å’Œ"(ğ‘ ğ‘›ğ‘œ,ğ‘ğ‘›ğ‘œ)â†’ğ‘¡ğ‘›ğ‘œï¼Œ"å®ƒæ˜¯æ»¡è¶³" 3ğ‘ğ¹çš„

1. æ•°æ®å‡†å¤‡ï¼Œè®¾ç½®ğ‘ ğ‘›ğ‘œ,ğ‘¡ğ‘›ğ‘œ, ğ‘ğ‘›ğ‘œçš„å–å€¼èŒƒå›´åˆ†åˆ«æ˜¯1~10000, 1~1000, 1~100, äº§ç”Ÿéšæœºè¡Œï¼Œæ’å…¥åˆ°ä¸€ä¸ªä¸´æ—¶è¡¨ğ‘¡ğ‘šğ‘ğ‘†ğ‘‡ğ¶ ï¼Œå»é‡åä¿è¯æ•°æ®æœ‰è‡³å°‘100000è¡Œ
2. å°†(ğ‘ ğ‘›ğ‘œ,ğ‘ğ‘›ğ‘œ)"å’Œ" ğ‘¡ğ‘›ğ‘œå£°æ˜ä¸ºuniqueï¼Œç„¶åæŠŠğ‘¡ğ‘šğ‘ğ‘†ğ‘‡ğ¶ä¸­æ•°æ®å¯¼å…¥åˆ°è¡¨ğ‘†ğ‘‡ğ¶ä¸­ï¼ŒæŸ¥çœ‹ç”¨æ—¶åŠå¯¼å…¥æˆåŠŸçš„è¡Œæ•°ï¼Œå¹¶ç»Ÿè®¡(tno,Â cno)çš„å†—ä½™ï¼Œè¿™å°±æ˜¯3NFä¸ºç»´æŠ¤å‡½æ•°ä¾èµ–æ‰€ä»˜å‡ºçš„ä»£ä»·
3. ğµğ¶ğ‘ğ¹è®¾è®¡åˆ™ä¼šæŠŠğ‘†ğ‘‡ğ¶(ğ‘ ğ‘›ğ‘œ,ğ‘¡ğ‘›ğ‘œ,ğ‘ğ‘›ğ‘œ)åˆ†è§£ä¸ºğ‘†ğ¶(ğ‘ ğ‘›ğ‘œ, ğ‘ğ‘›ğ‘œ)å’Œğ‘‡ğ¶(ğ‘¡ğ‘›ğ‘œ,ğ‘ğ‘›ğ‘œ)  ï¼Œè¿™æ—¶åªéœ€è¦ç»´æŠ¤ğ‘‡ğ¶ä¸Šçš„ğ‘¡ğ‘›ğ‘œâ†’ğ‘ğ‘›ğ‘œ,å°†ğ‘¡ğ‘›ğ‘œå£°æ˜ä¸ºuniqueï¼ŒåŒæ ·æŠŠğ‘¡ğ‘šğ‘ğ‘†ğ‘‡ğ¶ä¸­æ•°æ®å¯¼å…¥åˆ°è¡¨ğ‘‡ğ¶ä¸­ï¼ŒæŸ¥çœ‹ç”¨æ—¶ä»¥åŠå¯¼å…¥æˆåŠŸçš„è¡Œæ•°
4. ä½¿ç”¨è§¦å‘å™¨æ¥å®ç°ğ‘†ğ‘‡ğ¶ä¸Šçš„è¿™ä¸¤ä¸ªå‡½æ•°ä¾èµ–ï¼Œçœ‹çœ‹å®Œæˆğ‘¡ğ‘šğ‘ğ‘†ğ‘‡ğ¶æ•°æ®å¯¼å…¥åˆ°ğ‘†ğ‘‡ğ¶çš„ç”¨æ—¶

å…ˆæ¸…ç†

In [183]:
%%sql 

drop table if exists tmpSTC;
drop table if exists STC;
drop table if exists SC;
drop table if exists TC;
drop table if exists STC_trigger;
DROP PROCEDURE IF EXISTS generate_random_data;

show tables;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
4 rows affected.

[('code_table',), ('dept',), ('emp',), ('tmptable',)]

1. å‡†å¤‡æ•°æ®

In [184]:
%%sql

-- åˆ›å»ºä¸´æ—¶è¡¨tmpSTC
CREATE TABLE tmpSTC (
    sno INT,
    tno INT,
    cno INT,
    PRIMARY KEY (sno, tno, cno)
);

-- åˆ›å»ºå­˜å‚¨è¿‡ç¨‹
CREATE PROCEDURE generate_random_data()
BEGIN
    DECLARE i INT DEFAULT 0;
    DECLARE inserted_rows INT DEFAULT 0;
    DECLARE target_rows INT DEFAULT 100000;
    DECLARE new_sno INT;
    DECLARE new_tno INT;
    DECLARE new_cno INT;
    
    WHILE inserted_rows < target_rows DO
        -- ç”Ÿæˆéšæœºè¡Œ
        SET new_sno = FLOOR(1 + RAND() * 10000);
        SET new_tno = FLOOR(1 + RAND() * 1000);
        SET new_cno = FLOOR(1 + RAND() * 100);
        
        -- æ£€æŸ¥è¯¥è¡Œæ˜¯å¦å·²å­˜åœ¨
        IF NOT EXISTS (SELECT 1 FROM tmpSTC WHERE sno = new_sno AND tno = new_tno AND cno = new_cno) THEN
            INSERT INTO tmpSTC (sno, tno, cno) VALUES (new_sno, new_tno, new_cno);
            SET inserted_rows = inserted_rows + 1;
        END IF;
        
        SET i = i + 1;
    END WHILE;
END;

-- è°ƒç”¨å­˜å‚¨è¿‡ç¨‹ç”Ÿæˆéšæœºæ•°æ®
CALL generate_random_data();

SELECT COUNT(*) FROM tmpSTC;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.

[(100000,)]

2. å£°æ˜ Unique çº¦æŸå¹¶å¯¼å…¥æ•°æ®

In [185]:
%%sql

drop table if exists STC;
CREATE TABLE STC (
    sno INT,
    tno INT UNIQUE,
    cno INT,
    PRIMARY KEY (sno, cno)
);

INSERT IGNORE INTO STC (sno, tno, cno) SELECT * FROM tmpSTC;

SELECT COUNT(*) AS STC_CNT FROM STC;

SELECT COUNT(*) - COUNT(DISTINCT tno, cno) AS redundancy FROM STC;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
1000 rows affected.
1 rows affected.
1 rows affected.

[(0,)]

3. BCNF è®¾è®¡

å¯¹äº BCNF çš„è®¾è®¡ï¼Œæˆ‘ä»¬å°†è¡¨åˆ†è§£ä¸º SC å’Œ TCã€‚

In [186]:
%%sql

-- åˆ›å»ºè¡¨SCå’ŒTC
drop table if exists SC;
CREATE TABLE SC (
    sno INT,
    cno INT,
    PRIMARY KEY (sno, cno)
);

drop table if exists TC;
CREATE TABLE TC (
    tno INT UNIQUE,
    cno INT,
    PRIMARY KEY (tno, cno)
);

INSERT IGNORE INTO SC (sno, cno)
SELECT DISTINCT sno, cno FROM tmpSTC;

INSERT IGNORE INTO TC (tno, cno)
SELECT DISTINCT tno, cno FROM tmpSTC;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
95492 rows affected.
1000 rows affected.

[]

4. ä½¿ç”¨è§¦å‘å™¨ç»´æŠ¤å‡½æ•°ä¾èµ–

In [189]:
%%sql

-- å½“ tno æ›´æ–°å¯¼è‡´ cno æ”¹å˜æ—¶çš„è§¦å‘å™¨
drop trigger if exists update_cno;
CREATE TRIGGER update_cno AFTER UPDATE ON STC
FOR EACH ROW
BEGIN
    IF NEW.tno <> OLD.tno THEN
        UPDATE STC SET cno = (SELECT cno FROM STC WHERE tno = NEW.tno LIMIT 1)
        WHERE sno = NEW.sno;
    END IF;
END;

-- å½“ sno æˆ– cno æ›´æ–°å¯¼è‡´ tno æ”¹å˜æ—¶çš„è§¦å‘å™¨
drop trigger if exists update_tno;
CREATE TRIGGER update_tno AFTER UPDATE ON STC
FOR EACH ROW
BEGIN
    IF NEW.sno <> OLD.sno OR NEW.cno <> OLD.cno THEN
        UPDATE STC SET tno = (SELECT tno FROM STC WHERE sno = NEW.sno AND cno = NEW.cno LIMIT 1)
        WHERE sno = NEW.sno AND cno = NEW.cno;
    END IF;
END;

-- æµ‹é‡å¼€å§‹æ—¶é—´
SET @start_time = CURRENT_TIMESTAMP();

-- æ’å…¥æ•°æ®åˆ° STC
INSERT IGNORE INTO STC (sno, tno, cno)
SELECT * FROM tmpSTC;

-- æµ‹é‡ç»“æŸæ—¶é—´
SET @end_time = CURRENT_TIMESTAMP();

-- è®¡ç®—æ—¶é—´å·®
SELECT TIMESTAMPDIFF(SECOND, @start_time, @end_time) AS duration_seconds;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.

[(4,)]